In [1]:
import pandas as pd

In [76]:
import pandas as pd

trips = pd.DataFrame({
    "id": [1,2,3,4,5,6,7,8,9,10],
    "client_id": [1,2,3,4,1,2,3,2,3,4],
    "driver_id": [10,11,12,13,10,11,12,12,10,13],
    "city_id": [1,1,6,6,1,6,12,12,12,12],
    "status": [
        "completed", "cancelled_by_driver", "completed", "cancelled_by_client",
        "completed", "completed", "completed", "completed", "completed", "cancelled_by_driver"
    ],
    "request_at": [
        "2013-10-01","2013-10-01","2013-10-01","2013-10-01",
        "2013-10-02","2013-10-02","2013-10-02",
        "2013-10-03","2013-10-03","2013-10-03"
    ]
})

trips["request_at"] = pd.to_datetime(trips["request_at"])
trips

   id  client_id  driver_id  city_id               status request_at
0   1          1         10        1            completed 2013-10-01
1   2          2         11        1  cancelled_by_driver 2013-10-01
2   3          3         12        6            completed 2013-10-01
3   4          4         13        6  cancelled_by_client 2013-10-01
4   5          1         10        1            completed 2013-10-02
5   6          2         11        6            completed 2013-10-02
6   7          3         12       12            completed 2013-10-02
7   8          2         12       12            completed 2013-10-03
8   9          3         10       12            completed 2013-10-03
9  10          4         13       12  cancelled_by_driver 2013-10-03

In [77]:
users = pd.DataFrame({
    "users_id": [1,2,3,4,10,11,12,13],
    "banned": ["No","Yes","No","No","No","No","No","No"],
    "role": ["client","client","client","client","driver","driver","driver","driver"]
})

users

   users_id banned    role
0         1     No  client
1         2    Yes  client
2         3     No  client
3         4     No  client
4        10     No  driver
5        11     No  driver
6        12     No  driver
7        13     No  driver

In [ ]:
aaa

In [2]:
weather = pd.DataFrame({
    "id": [1, 2, 3, 4],
    "recordDate": ["2015-01-01", "2015-01-02", "2015-01-03", "2015-01-04"],
    "temperature": [10, 25, 20, 30]
})

In [71]:
weather = pd.DataFrame({
    "id": [1, 2],
    "recordDate": ["2015-12-16", "2015-12-15"],
    "temperature": [3, -1]
})

In [72]:
weather = weather.sort_values('recordDate').reset_index(drop = True)
weather

   id  recordDate  temperature
0   2  2015-12-15           -1
1   1  2015-12-16            3

In [73]:
larger = []

for i in range(len(weather.id)-1):
    if weather.temperature[i] < weather.temperature[i+1]:
        larger.append(i+1)

In [74]:
larger

[1]

In [67]:
weather.iloc[larger]

Empty DataFrame
Columns: [id, recordDate, temperature]
Index: []

In [22]:
larger

[1, 3]

In [16]:
employee = pd.DataFrame({
    "id": [1, 2, 3, 4, 5, 6, 7],
    "name": ["Joe", "Henry", "Sam", "Max", "Janet", "Randy", "Will"],
    "salary": [85000, 80000, 60000, 90000, 69000, 85000, 70000],
    "departmentId": [1, 2, 2, 1, 1, 1, 1]
})

department = pd.DataFrame({
    "id": [1, 2],
    "name": ["IT", "Sales"]
})

In [23]:
join = employee.merge(department, how="left", left_on = "departmentId", right_on = "id", suffixes=("", "_dep"))
print(join)

   id   name  salary  departmentId  id_dep name_dep
0   1    Joe   85000             1       1       IT
1   2  Henry   80000             2       2    Sales
2   3    Sam   60000             2       2    Sales
3   4    Max   90000             1       1       IT
4   5  Janet   69000             1       1       IT
5   6  Randy   85000             1       1       IT
6   7   Will   70000             1       1       IT

In [25]:
new = join[['id', 'name', 'salary', 'departmentId', 'name_dep']]
print(new)

   id   name  salary  departmentId name_dep
0   1    Joe   85000             1       IT
1   2  Henry   80000             2    Sales
2   3    Sam   60000             2    Sales
3   4    Max   90000             1       IT
4   5  Janet   69000             1       IT
5   6  Randy   85000             1       IT
6   7   Will   70000             1       IT

In [55]:
grouped = new.groupby(by = 'name_dep')['salary'].apply(lambda x: x.drop_duplicates().nlargest(3)).reset_index()
print(grouped)

  name_dep  level_1  salary
0       IT        3   90000
1       IT        0   85000
2       IT        6   70000
3    Sales        1   80000
4    Sales        2   60000

In [57]:
df = employee.merge(grouped, on = "salary", how = "left")
print(df)

   id   name  salary  departmentId name_dep  level_1
0   1    Joe   85000             1       IT      0.0
1   2  Henry   80000             2    Sales      1.0
2   3    Sam   60000             2    Sales      2.0
3   4    Max   90000             1       IT      3.0
4   5  Janet   69000             1      NaN      NaN
5   6  Randy   85000             1       IT      0.0
6   7   Will   70000             1       IT      6.0

In [60]:
df = df[['name_dep', 'name', 'salary']]
print(df)

  name_dep   name  salary
0       IT    Joe   85000
1    Sales  Henry   80000
2    Sales    Sam   60000
3       IT    Max   90000
4      NaN  Janet   69000
5       IT  Randy   85000
6       IT   Will   70000

In [63]:
df = df.rename(columns = {"name_dep": "Depertment", "name":"Employee","salary": "Salary"})
df = df.dropna()
print(df)

  Depertment Employee  Salary
0         IT      Joe   85000
1      Sales    Henry   80000
2      Sales      Sam   60000
3         IT      Max   90000
5         IT    Randy   85000
6         IT     Will   70000

In [50]:
it = pd.DataFrame(grouped)
print(it)

            salary
name_dep
IT       3   90000
         0   85000
         5   85000
Sales    1   80000
         2   60000

In [51]:
print(it.salary)

name_dep
IT        3    90000
          0    85000
          5    85000
Sales     1    80000
          2    60000
Name: salary, dtype: int64

In [32]:
print(new.nlargest(3, 'salary'))

   id   name  salary  departmentId name_dep
3   4    Max   90000             1       IT
0   1    Joe   85000             1       IT
5   6  Randy   85000             1       IT

In [64]:
join = employee.merge(
    department,
    how="left",
    left_on="departmentId",
    right_on="id",
    suffixes=("", "_dep")
)
new = join[['id', 'name', 'salary', 'departmentId', 'name_dep']]

# Get top 3 UNIQUE salaries per department
grouped = (
    new.groupby("name_dep")["salary"]
       .apply(lambda s: s.drop_duplicates().nlargest(3))
       .reset_index()
       .rename(columns={"level_1": "row_id"})
)

# Merge back to the joined employee table using row index
df = new.merge(grouped, left_index=True, right_on="row_id", how="inner")

In [65]:
print(df)

   id   name  salary_x  departmentId name_dep_x name_dep_y  row_id  salary_y
1   1    Joe     85000             1         IT         IT       0     85000
3   2  Henry     80000             2      Sales      Sales       1     80000
4   3    Sam     60000             2      Sales      Sales       2     60000
0   4    Max     90000             1         IT         IT       3     90000
2   7   Will     70000             1         IT         IT       6     70000